spec/load/getQuestions.yaml
config:
  target: "http://thebest.graphics"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 1000
      name: Warm up
    - duration: 60
      arrivalRate: 1000
      name: A lot
scenarios:
  - name: "Load products"
    flow:
      - get:
          url: "/questions?product_id={{ $randomNumber(900000,1000000) }}"